app/controllers/friends_controller.rb

  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "abcd"], ["email", "co@gmail.com"], ["phone", "1234"], ["twitter", ""], ["created_at", "2023-03-09 04:34:46.506637"], ["updated_at", "2023-03-09 04:34:46.506637"], ["user_id", 5]]